In [1]:
import numpy  as np
import pandas as pd

from IPython.display import display

from invisible_cities.io.dst_io import load_dst

In [2]:
# Increase the number of displayed columns to 100
pd.set_option("display.max_columns", 100)

# What are Series and dataframes

Series are sequences with arbitrary indexing (usually called label). You may use an accumulative index (which will always be available).

In [3]:
pd.Series(np.random.uniform(0, 1, 10)) # regular indexing

0    0.212218
1    0.820177
2    0.352776
3    0.586164
4    0.664611
5    0.978937
6    0.293461
7    0.300923
8    0.709908
9    0.006202
dtype: float64

In [4]:
pd.Series(np.random.uniform(0, 1, 10), index=list("abcdefghij")) # regular indexing

a    0.540050
b    0.715063
c    0.538731
d    0.279913
e    0.232281
f    0.751260
g    0.273586
h    0.293249
i    0.840400
j    0.699869
dtype: float64

In [5]:
pd.Series(np.random.uniform(0, 1, 10), index=pd.date_range('2020-01-01', '2020-01-10')) # regular indexing

2020-01-01    0.026543
2020-01-02    0.206022
2020-01-03    0.907431
2020-01-04    0.357239
2020-01-05    0.884242
2020-01-06    0.685939
2020-01-07    0.472974
2020-01-08    0.272447
2020-01-09    0.564410
2020-01-10    0.041385
Freq: D, dtype: float64

A dataframe is a collection of Series with a common index. Both objects are essentially fancy tables.

In [6]:
pd.DataFrame(np.random.uniform(0, 1, (10, 4)),
             columns = list("ABCD"),
             index   = pd.date_range('2020-01-01', '2020-01-10')) # regular indexing

                   A         B         C         D
2020-01-01  0.675841  0.807193  0.428101  0.546683
2020-01-02  0.969917  0.700297  0.864586  0.028602
2020-01-03  0.619099  0.558840  0.726367  0.011983
2020-01-04  0.835058  0.861452  0.358718  0.463221
2020-01-05  0.918871  0.268245  0.831400  0.404796
2020-01-06  0.058361  0.952122  0.430613  0.325523
2020-01-07  0.488515  0.748222  0.267857  0.637535
2020-01-08  0.132286  0.163847  0.873642  0.427733
2020-01-09  0.420804  0.786272  0.832608  0.313158
2020-01-10  0.572801  0.313264  0.788345  0.452328

# Building a Series

In [7]:
series_0 = pd.Series(data  = np.random.uniform(0, 1, 10)              ,
                     index = pd.date_range('2020-01-01', '2020-01-10'), # optional, default is regular indexing
                     dtype = np.float                                 , # optional, default is inferred
                     name  = "Minutes worked"                         ) # optional, defualt None
series_0

2020-01-01    0.399776
2020-01-02    0.870127
2020-01-03    0.812896
2020-01-04    0.495983
2020-01-05    0.548484
2020-01-06    0.540679
2020-01-07    0.450429
2020-01-08    0.028334
2020-01-09    0.324263
2020-01-10    0.887123
Freq: D, Name: Minutes worked, dtype: float64

In [8]:
series_1 = pd.Series(data  = np.random.uniform(0, 1, 10),
                     index = list("ABCDEFGHIJ")         , # optional, default is regular indexing
                     dtype = np.float                   , # optional, default is inferred
                     name  = "Letter affinity"          ) # optional, defualt None
series_1

A    0.379427
B    0.773737
C    0.077884
D    0.885316
E    0.521344
F    0.993742
G    0.382982
H    0.742614
I    0.945282
J    0.771061
Name: Letter affinity, dtype: float64

# Building a dataframe

Probably the easiest manner is to use a dictionary to combine column names with data

In [67]:
xyz_df_0 = pd.DataFrame(dict(n = np.random.poisson( 4,     10),
                             x = np.random.uniform(-2, -1, 10),
                             y = np.random.uniform( 1,  2, 10),
                             z = np.random.normal ( 0,  1, 10)),
                        index  = list("ABCDEFGHIJ"))             # optional, defaults to regular indexing
xyz_df_0

   n         x         y         z
A  0 -1.304686  1.469194  0.355725
B  5 -1.325811  1.471220 -0.650498
C  5 -1.931372  1.668060  0.513859
D  4 -1.744058  1.286778  0.235089
E  3 -1.158702  1.253674  1.369917
F  2 -1.843333  1.845640 -0.562510
G  6 -1.304873  1.032722 -0.087490
H  4 -1.684381  1.584054 -0.664299
I  2 -1.525103  1.644306 -1.258407
J  5 -1.848859  1.058591 -0.385586

Let's use a more realistic case and assume the index is something like an event number. We can attach a name to this index as well. Indices can repeat!

In [68]:
xyz_df_1 = pd.DataFrame(dict(n = np.random.poisson( 4,     10),
                             x = np.random.uniform(-2, -1, 10),
                             y = np.random.uniform( 1,  2, 10),
                             z = np.random.normal ( 0,  1, 10)),
                        index  = [0] * 3 + [1] * 3 + [4] * 4   )

xyz_df_1.index.name = "event"

xyz_df_1

   n         x         y         z
0  1 -1.905912  1.546298 -2.062060
0  2 -1.311056  1.805632  1.625085
0  0 -1.082180  1.086400 -1.763810
1  5 -1.298341  1.764000 -1.144081
1  5 -1.167679  1.488775 -0.069619
1  2 -1.054178  1.926256 -0.746532
4  4 -1.890491  1.448601 -0.529354
4  6 -1.196656  1.634814 -1.445950
4  4 -1.716060  1.123835  1.272805
4  2 -1.012853  1.900108 -1.299746

The same can be done with `pd.Series`

### Exercise 0

Create two or three series (regular indexing). Join them in a dataframe. Each row should correspond to a different time in the same day

# Displaying a Series/DataFrame

There are a few functionalities to play around with Series and DataFrames. These work for both

In [11]:
xyz_df_0.head()

          x         y         z
A -1.688764  1.898075  0.692154
B -1.885728  1.259110  0.304189
C -1.270912  1.773814 -1.164984
D -1.560103  1.029880  2.217780
E -1.185825  1.585435 -0.265309

In [12]:
xyz_df_0.tail()

          x         y         z
F -1.847298  1.633904 -0.099170
G -1.853815  1.806326 -0.917928
H -1.311706  1.120622  0.304014
I -1.973770  1.799369 -0.058456
J -1.493037  1.431419 -0.784553

You can know the columns of a DataFrame as

In [13]:
xyz_df_0.columns

Index(['x', 'y', 'z'], dtype='object')

And the shape (nrows, ncols) as

In [14]:
xyz_df_0.shape

(10, 3)

# Statistics

In [15]:
series_0.describe() # get a series that gives stat info about the data

count    10.000000
mean      0.535809
std       0.267045
min       0.028334
25%       0.412439
50%       0.518331
75%       0.746793
max       0.887123
Name: Minutes worked, dtype: float64

In [16]:
xyz_df_0.describe() # get a dataframe that gives stat info about each column

               x          y          z
count  10.000000  10.000000  10.000000
mean   -1.607096   1.533796   0.022774
std     0.284856   0.308829   0.970472
min    -1.973770   1.029880  -1.164984
25%    -1.852186   1.302187  -0.654742
50%    -1.624434   1.609670  -0.078813
75%    -1.357039   1.792980   0.304145
max    -1.185825   1.898075   2.217780

In [17]:
print(f"""For series_0:
mean = {series_0.mean()}
std  = {series_0.std ()}
min  = {series_0.min ()}
max  = {series_0.max ()}
half = {series_0.quantile(0.5)}
len  = {series_0.count()} = {series_0.size}
""")

For series_0:
mean = 0.5358093793809602
std  = 0.2670446237863216
min  = 0.028333890903901704
max  = 0.8871225410700543
half = 0.518331359827751
len  = 10 = 10

Same can be used for a dataframe, producing a Series with the value for each column

In [18]:
xyz_df_0.mean()

x   -1.607096
y    1.533796
z    0.022774
dtype: float64

# Indexing

### By position or index/label

In [19]:
series_1["A"] # by label

0.3794269877856471

This works only for series. Dataframes interpret the argument as a column name

In [20]:
try:
    xyz_df_0["A"]
except KeyError as error:
    print("KeyError:", error)

KeyError: 'A'

In [21]:
xyz_df_0["x"] # This produces a Series

A   -1.688764
B   -1.885728
C   -1.270912
D   -1.560103
E   -1.185825
F   -1.847298
G   -1.853815
H   -1.311706
I   -1.973770
J   -1.493037
Name: x, dtype: float64

`[]` is good for playing around, but you don't know if what you are getting is a copy or a view. For serious stuff it is better to use `loc` and `iloc`, which should be as fast (if not faster) and you are guaranteed to get a view (i.e. the same memory positions). This means that modifications to the object you get affect the original one.

In [22]:
series_1.loc["D"] # by label

0.8853158219244455

In [23]:
series_1.iloc[3] # by position, i.e. row number

0.8853158219244455

In [24]:
xyz_df_0.loc["D"] # by label

x   -1.560103
y    1.029880
z    2.217780
Name: D, dtype: float64

In [25]:
xyz_df_0.iloc[3] # by position, i.e. row number

x   -1.560103
y    1.029880
z    2.217780
Name: D, dtype: float64

These methods also work with arrays

In [26]:
series_0.iloc[[1, 5, 6]] # by position

2020-01-02    0.870127
2020-01-06    0.540679
2020-01-07    0.450429
Name: Minutes worked, dtype: float64

Or slices!

In [27]:
series_0.iloc[3:6]

2020-01-04    0.495983
2020-01-05    0.548484
2020-01-06    0.540679
Freq: D, Name: Minutes worked, dtype: float64

For dataframes, rows are columns can be selected simultaneously. Also, the indices or columns do not need to be in the same order as the df

In [28]:
xyz_df_0.loc[list("EAC"), list("zx")]

          z         x
E -0.265309 -1.185825
A  0.692154 -1.688764
C -1.164984 -1.270912

Because `loc` returns a view, the original object can be modified. We use a slice range to modify one of the columns of the dataframe

This is important when having to perform many operations on big dataframes, as the copy operations introduce a huge overhead

In [34]:
xyz_df_2 = xyz_df_0.copy()
xyz_df_2

          x         y         z
A -1.688764  1.898075  0.692154
B -1.885728  1.259110  0.304189
C -1.270912  1.773814 -1.164984
D -1.560103  1.029880  2.217780
E -1.185825  1.585435 -0.265309
F -1.847298  1.633904 -0.099170
G -1.853815  1.806326 -0.917928
H -1.311706  1.120622  0.304014
I -1.973770  1.799369 -0.058456
J -1.493037  1.431419 -0.784553

In [35]:
xyz_df_2.loc["D":"I", "y"] *= 100

In [36]:
xyz_df_2

          x           y         z
A -1.688764    1.898075  0.692154
B -1.885728    1.259110  0.304189
C -1.270912    1.773814 -1.164984
D -1.560103  102.987983  2.217780
E -1.185825  158.543528 -0.265309
F -1.847298  163.390446 -0.099170
G -1.853815  180.632627 -0.917928
H -1.311706  112.062235  0.304014
I -1.973770  179.936903 -0.058456
J -1.493037    1.431419 -0.784553

### Indexing with default value

In [39]:
series_1.get("A", np.nan) # Exists, returns value

0.3794269877856471

In [40]:
series_1.get("dog", np.nan) # Does not exist, returns default

nan

### Indexing with row-column pairs

In [41]:
xyz_df_0.lookup(["A", "C", "I", "H", "B"], ['x', 'x', 'y', 'z', 'z'])
# Take x from row A
# Take x from row C
# Take y from row I
# Take z from row H
# Take z from row B

array([-1.6887641 , -1.27091231,  1.79936903,  0.30401436,  0.30418891])

### Fast single-element indexing

This method should only be used for accessing a reduced number of elements. Long iterations using this method are very (very) slow.

In [45]:
series_1.iat[4], series_1.at["E"] # position and index

(0.5213441442928834, 0.5213441442928834)

In [47]:
xyz_df_0.iat[4, 2], xyz_df_0.at["E", "z"]

(-0.26530935942910505, -0.26530935942910505)

### Selection by booleans

Essentially the same as for numpy

In [64]:
mask = series_0 > 0.5
series_0[mask]

2020-01-02    0.870127
2020-01-03    0.812896
2020-01-05    0.548484
2020-01-06    0.540679
2020-01-10    0.887123
Name: Minutes worked, dtype: float64

In [61]:
mask  = xyz_df_0.x > -1.5
mask &= xyz_df_0.y <  1.5
mask &= xyz_df_0.z > xyz_df_0.z.quantile(0.5)

In [62]:
xyz_df_0[mask] # This is a copy! Use loc to avoid it

          x         y         z
H -1.311706  1.120622  0.304014

### Selection by query

This method is not of common use. In words of the developers:
```
A use case for query() is when you have a collection of DataFrame objects that have a subset of column      names (or index levels/names) in common. You can pass the same query to both frames without having to      specify which frame youâ€™re interested in querying
```
Which is not a frequent scenario. Avoid using it unless you find yourself doing something like this.

In [66]:
quantile = xyz_df_0.z.quantile(0.6)
xyz_df_0.query(f"x < -1.5 & y > 1.5 & z > {quantile}")

          x         y         z
A -1.688764  1.898075  0.692154

### Useful functions for selections

In [69]:
xyz_df_0.n.isin([4, 5]) # True if value is in the provided list, False otherwise

A    False
B     True
C     True
D     True
E    False
F    False
G    False
H     True
I    False
J     True
Name: n, dtype: bool

In [74]:
series_2 = series_0.copy()
series_2.iloc[3::3] = np.nan
series_2.isna() # True if value is a NaN They can also be dropped with series.dropna()

2020-01-01    False
2020-01-02    False
2020-01-03    False
2020-01-04     True
2020-01-05    False
2020-01-06    False
2020-01-07     True
2020-01-08    False
2020-01-09    False
2020-01-10     True
Freq: D, Name: Minutes worked, dtype: bool

In [76]:
xyz_df_0.n.duplicated()
# True if the is duplicated. Default is to mark as duplicated only 2nd, 3rd, ... occurrences
# Check docs for other options

A    False
B    False
C     True
D    False
E    False
F    False
G    False
H     True
I     True
J     True
Name: n, dtype: bool

# Sampling

We can take samples from a series

In [77]:
series_0.sample()

2020-01-10    0.887123
Freq: D, Name: Minutes worked, dtype: float64

Or many at a time

In [79]:
xyz_df_0.sample(3)

   n         x         y         z
G  6 -1.304873  1.032722 -0.087490
E  3 -1.158702  1.253674  1.369917
D  4 -1.744058  1.286778  0.235089

Or a fraction of the total

In [81]:
series_1.sample(frac=0.334)

B    0.773737
G    0.382982
D    0.885316
Name: Letter affinity, dtype: float64

# Combining data

### Row-wise

In [85]:
first_events = xyz_df_0.iloc[  :3]
last_events  = xyz_df_1.iloc[-3: ]
display(first_events, last_events)

   n         x         y         z
A  0 -1.304686  1.469194  0.355725
B  5 -1.325811  1.471220 -0.650498
C  5 -1.931372  1.668060  0.513859

   n         x         y         z
4  6 -1.196656  1.634814 -1.445950
4  4 -1.716060  1.123835  1.272805
4  2 -1.012853  1.900108 -1.299746

In [86]:
pd.concat([first_events, last_events]) # New dataframe

   n         x         y         z
A  0 -1.304686  1.469194  0.355725
B  5 -1.325811  1.471220 -0.650498
C  5 -1.931372  1.668060  0.513859
4  6 -1.196656  1.634814 -1.445950
4  4 -1.716060  1.123835  1.272805
4  2 -1.012853  1.900108 -1.299746

The same can be achieved with `append`

In [87]:
first_events.append(last_events) # new dataframe!

   n         x         y         z
A  0 -1.304686  1.469194  0.355725
B  5 -1.325811  1.471220 -0.650498
C  5 -1.931372  1.668060  0.513859
4  6 -1.196656  1.634814 -1.445950
4  4 -1.716060  1.123835  1.272805
4  2 -1.012853  1.900108 -1.299746

You may also append (or concat) a series

In [90]:
first_events.append(xyz_df_1.iloc[4]) # new dataframe!

     n         x         y         z
A  0.0 -1.304686  1.469194  0.355725
B  5.0 -1.325811  1.471220 -0.650498
C  5.0 -1.931372  1.668060  0.513859
1  5.0 -1.167679  1.488775 -0.069619

### Column-wise

In [112]:
first_columns = xyz_df_1.iloc[:,   :1]
last_columns  = xyz_df_1.iloc[:, -2: ]
display(first_columns, last_columns)

   n
0  1
0  2
0  0
1  5
1  5
1  2
4  4
4  6
4  4
4  2

          y         z
0  1.546298 -2.062060
0  1.805632  1.625085
0  1.086400 -1.763810
1  1.764000 -1.144081
1  1.488775 -0.069619
1  1.926256 -0.746532
4  1.448601 -0.529354
4  1.634814 -1.445950
4  1.123835  1.272805
4  1.900108 -1.299746

In [98]:
pd.concat([first_columns, last_columns], axis=1) # New dataframe

   n         y         z
0  1  1.546298 -2.062060
0  2  1.805632  1.625085
0  0  1.086400 -1.763810
1  5  1.764000 -1.144081
1  5  1.488775 -0.069619
1  2  1.926256 -0.746532
4  4  1.448601 -0.529354
4  6  1.634814 -1.445950
4  4  1.123835  1.272805
4  2  1.900108 -1.299746

If there are repeated columns the default behaviour is to keep both (`join="outer"`). Use `join="inner"` to keep the intersection.

You may also concatenate a series to a dataframe

In [114]:
pd.concat([first_columns, xyz_df_1.y], axis=1)

   n         y
0  1  1.546298
0  2  1.805632
0  0  1.086400
1  5  1.764000
1  5  1.488775
1  2  1.926256
4  4  1.448601
4  6  1.634814
4  4  1.123835
4  2  1.900108

### Exercise N: join `xyz_df_0` and `xyz_df_2` using `join="outer"`

In [110]:
display(xyz_df_0, xyz_df_2)

   n         x         y         z
A  0 -1.304686  1.469194  0.355725
B  5 -1.325811  1.471220 -0.650498
C  5 -1.931372  1.668060  0.513859
D  4 -1.744058  1.286778  0.235089
E  3 -1.158702  1.253674  1.369917
F  2 -1.843333  1.845640 -0.562510
G  6 -1.304873  1.032722 -0.087490
H  4 -1.684381  1.584054 -0.664299
I  2 -1.525103  1.644306 -1.258407
J  5 -1.848859  1.058591 -0.385586

          x           y         z
A -1.688764    1.898075  0.692154
B -1.885728    1.259110  0.304189
C -1.270912    1.773814 -1.164984
D -1.560103  102.987983  2.217780
E -1.185825  158.543528 -0.265309
F -1.847298  163.390446 -0.099170
G -1.853815  180.632627 -0.917928
H -1.311706  112.062235  0.304014
I -1.973770  179.936903 -0.058456
J -1.493037    1.431419 -0.784553

# Grouping data

Usually we want to perform operations to groups of data. The most common cases is "I want to do this event by event" or "peak by peak". The easiest way is to use `groupby`.

In [120]:
display(xyz_df_1)
groups = xyz_df_1.groupby("event")

k = 0
for event_no, subdf in groups:
    display(subdf)

       n         x         y         z
event
0      1 -1.905912  1.546298 -2.062060
0      2 -1.311056  1.805632  1.625085
0      0 -1.082180  1.086400 -1.763810
1      5 -1.298341  1.764000 -1.144081
1      5 -1.167679  1.488775 -0.069619
1      2 -1.054178  1.926256 -0.746532
4      4 -1.890491  1.448601 -0.529354
4      6 -1.196656  1.634814 -1.445950
4      4 -1.716060  1.123835  1.272805
4      2 -1.012853  1.900108 -1.299746

       n         x         y         z
event
0      1 -1.905912  1.546298 -2.062060
0      2 -1.311056  1.805632  1.625085
0      0 -1.082180  1.086400 -1.763810

       n         x         y         z
event
1      5 -1.298341  1.764000 -1.144081
1      5 -1.167679  1.488775 -0.069619
1      2 -1.054178  1.926256 -0.746532

       n         x         y         z
event
4      4 -1.890491  1.448601 -0.529354
4      6 -1.196656  1.634814 -1.445950
4      4 -1.716060  1.123835  1.272805
4      2 -1.012853  1.900108 -1.299746

We can also group by more than one label

In [121]:
groups = xyz_df_1.groupby(["event", "n"])

k = 0
for (event_no, peak_no), subdf in groups:
    display(subdf)

       n        x       y        z
event
0      0 -1.08218  1.0864 -1.76381

       n         x         y        z
event
0      1 -1.905912  1.546298 -2.06206

       n         x         y         z
event
0      2 -1.311056  1.805632  1.625085

       n         x         y         z
event
1      2 -1.054178  1.926256 -0.746532

       n         x         y         z
event
1      5 -1.298341  1.764000 -1.144081
1      5 -1.167679  1.488775 -0.069619

       n         x         y         z
event
4      2 -1.012853  1.900108 -1.299746

       n         x         y         z
event
4      4 -1.890491  1.448601 -0.529354
4      4 -1.716060  1.123835  1.272805

       n         x         y        z
event
4      6 -1.196656  1.634814 -1.44595

If we are interested in a specific group, not all of them, we can also get them

In [122]:
groups.get_group((1, 5)) # event=1, n=5

       n         x         y         z
event
1      5 -1.298341  1.764000 -1.144081
1      5 -1.167679  1.488775 -0.069619

# Applying operations on each group

We can get generic properties of each grup easily

In [123]:
groups = xyz_df_1.groupby("event")
groups.size() # Count rows in each group

event
0    3
1    3
4    4
dtype: int64

In [124]:
groups.mean()

       n         x         y         z
event
0      1 -1.433049  1.479443 -0.733595
1      4 -1.173399  1.726343 -0.653410
4      4 -1.454015  1.526839 -0.500561

We can get it for a specific column as well (faster if you don't need to apply the same operation onto many columns)

In [127]:
groups.x.mean() # groups["x"] would also work

event
0   -1.433049
1   -1.173399
4   -1.454015
Name: x, dtype: float64

We can also produce a new dataframe with this information with `aggregate`

In [128]:
groups.aggregate(np.sum) # Produce a dataframe indexed with event and summing all entries in each column

        n         x         y         z
event
0       3 -4.299148  4.438330 -2.200785
1      12 -3.520198  5.179030 -1.960231
4      16 -5.816060  6.107357 -2.002245

We may want to apply different operations to different columns

In [129]:
groups.aggregate(dict(n=np.sum, x=np.mean, y="min", z="first"))
# Same, but only with the specified operation to each column

        n         x         y         z
event
0       3 -1.433049  1.086400 -2.062060
1      12 -1.173399  1.488775 -1.144081
4      16 -1.454015  1.123835 -0.529354

You may also want to get many properties of the same data

In [130]:
groups.x.aggregate([np.mean, np.std, "count"]) # produce a df with these columns for each group

           mean       std  count
event
0     -1.433049  0.425201      3
1     -1.173399  0.122182      3
4     -1.454015  0.416348      4

It also works for a dataframe, but it gets messy

In [131]:
groups.aggregate(["min", "max"]) # Produce dataframe with two column levels

        n             x                   y                   z
      min max       min       max       min       max       min       max
event
0       0   2 -1.905912 -1.082180  1.086400  1.805632 -2.062060  1.625085
1       2   5 -1.298341 -1.054178  1.488775  1.926256 -1.144081 -0.069619
4       2   6 -1.890491 -1.012853  1.123835  1.900108 -1.445950  1.272805

You don't like these names? No problem!

In [132]:
groups.aggregate(dict(n=np.sum, x=np.mean, y="min", z="first"))\
      .rename(columns = dict(n = "sum_n", x = "av_x", y = "min_y", z = "first_z"))

       sum_n      av_x     min_y   first_z
event
0          3 -1.433049  1.086400 -2.062060
1         12 -1.173399  1.488775 -1.144081
4         16 -1.454015  1.123835 -0.529354

Naturally, you can use your functions. They must take an array (dataframe) and return a scalar (series). Warning, this might be super slow!

In [158]:
def weird_function(x):
    return -1 if np.sum(x) < -2 else +1

In [159]:
groups.z.aggregate([lambda x: np.max(x) - np.min(x), weird_function, np.sum])

       <lambda>  weird_function       sum
event
0      3.687145            -1.0 -2.200785
1      1.074462             1.0 -1.960231
4      2.718755            -1.0 -2.002245

This however, creates a problem when we try to add this group-dependent information to the original dataframe:

In [162]:
sum_n = xyz_df_1.groupby("event").n.aggregate("sum") # same as xyz_df_1.groupby("event").n.sum()
xyz_df_1.shape[0], sum_n.shape[0]

(10, 3)

This can be avoided using transform:

In [163]:
sum_n = xyz_df_1.groupby("event").n.transform("sum") # same as xyz_df_1.groupby("event").n.sum()
xyz_df_1.shape[0], sum_n.shape[0]

(10, 10)

This way we can add this information to the original dataframe

In [165]:
xyz_df_1.loc[:, "sum_n"] = xyz_df_1.groupby("event").n.transform(np.sum)

In [167]:
xyz_df_1

       n         x         y         z  sum_n
event
0      1 -1.905912  1.546298 -2.062060      3
0      2 -1.311056  1.805632  1.625085      3
0      0 -1.082180  1.086400 -1.763810      3
1      5 -1.298341  1.764000 -1.144081     12
1      5 -1.167679  1.488775 -0.069619     12
1      2 -1.054178  1.926256 -0.746532     12
4      4 -1.890491  1.448601 -0.529354     16
4      6 -1.196656  1.634814 -1.445950     16
4      4 -1.716060  1.123835  1.272805     16
4      2 -1.012853  1.900108 -1.299746     16

The function used in transform can either:
- Return a single value, in which case, the value is broadcasted to match the size of the group
- Return an array of values of the same size of the group. Each value get's assigned to the corresponding entry

In [168]:
xyz_df_1.groupby("event").z.transform(lambda v: v - v.min())

event
0    0.000000
0    3.687145
0    0.298249
1    0.000000
1    1.074462
1    0.397549
4    0.916596
4    0.000000
4    2.718755
4    0.146204
Name: z, dtype: float64

### *** Warning
* Using functions that are not "standard" increases the execution time. Avoid it whenever possible.
* This is because the standard ones are optimized by Cython. If you implement your custom function in cython (or if you cythonize it inline) it should be as fast

A good use of this method is to replace NaN values with, for example, the average value of each event.
### Exercise N+1: Use `transform` to do so with the following dataframe.

In [320]:
event = np.repeat(np.arange(5), 4)
x     = np.random.uniform(-1, 1, 20)
y     = np.random.uniform(-1, 1, 20)
x[[0, 5, 10, 15]] = np.nan
y[[4, 7, 10, 12]] = np.nan
df_with_nans = pd.DataFrame(dict(x=x, y=y), index=event)
df_with_nans

          x         y
0       NaN -0.764006
0  0.710762  0.841356
0 -0.738289  0.332039
0 -0.814058 -0.676908
1  0.309183       NaN
1       NaN  0.165469
1  0.107873 -0.098250
1 -0.262144       NaN
2  0.757714  0.290358
2 -0.952073 -0.743087
2       NaN       NaN
2  0.110101  0.168184
3 -0.522205       NaN
3 -0.810947 -0.451080
3  0.009237 -0.748188
3       NaN  0.454386
4  0.065898  0.974631
4  0.530056  0.562239
4  0.923338 -0.507810
4 -0.296437  0.296692

# Filtering groups

In [169]:
xyz_df_1.groupby("event").filter(lambda g: np.any(g.z) > 0)
# produces a new df by concatenating the groups that satisfy the condition concatenated

       n         x         y         z  sum_n
event
0      1 -1.905912  1.546298 -2.062060      3
0      2 -1.311056  1.805632  1.625085      3
0      0 -1.082180  1.086400 -1.763810      3
1      5 -1.298341  1.764000 -1.144081     12
1      5 -1.167679  1.488775 -0.069619     12
1      2 -1.054178  1.926256 -0.746532     12
4      4 -1.890491  1.448601 -0.529354     16
4      6 -1.196656  1.634814 -1.445950     16
4      4 -1.716060  1.123835  1.272805     16
4      2 -1.012853  1.900108 -1.299746     16

# Apply / applymap / map

- `apply` is used to generate new values from a dataframe from a function column- or row-wise. The function may or may not reduce the data
- `applymap` same but element-wise. It cannot reduce the data
- `map` is used to translate values

In [178]:
xyz_df_1.apply(lambda x: np.sqrt(np.sum(x**2)), axis=0) # default

n        11.445523
x         4.433916
y         5.051207
z         4.189923
sum_n    38.509739
dtype: float64

In [179]:
xyz_df_1.apply(lambda x: np.sqrt(np.sum(x**2)), axis=1)

event
0     4.502847
0     4.540933
0     3.802947
1    13.232774
1    13.137152
1    12.384630
4    16.671911
4    17.268334
4    16.668170
4    16.319486
dtype: float64

In [181]:
xyz_df_1.applymap(lambda x: np.sqrt(np.abs(x)))

              n         x         y         z     sum_n
event
0      1.000000  1.380548  1.243502  1.435987  1.732051
0      1.414214  1.145013  1.343738  1.274788  1.732051
0      0.000000  1.040279  1.042305  1.328085  1.732051
1      2.236068  1.139447  1.328157  1.069617  3.464102
1      2.236068  1.080592  1.220154  0.263853  3.464102
1      1.414214  1.026732  1.387896  0.864021  3.464102
4      2.000000  1.374951  1.203578  0.727567  4.000000
4      2.449490  1.093918  1.278598  1.202477  4.000000
4      2.000000  1.309985  1.060111  1.128187  4.000000
4      1.414214  1.006406  1.378444  1.140064  4.000000

In [191]:
mapping = {0: -1, 1: 10, 2: np.pi, 3: 44, 4:123, 5:1e3} # Missing values go missing!
xyz_df_1.loc[:, ["n"]].applymap(mapping.get) # Notice the list in `loc`: If forces the result to be a dataframe

                 n
event
0        10.000000
0         3.141593
0        -1.000000
1      1000.000000
1      1000.000000
1         3.141593
4       123.000000
4              NaN
4       123.000000
4         3.141593

In [192]:
mapping = {0: -1, 1: 10, 2: np.pi, 3: 44, 4:123, 5:1e3}
xyz_df_1.n.map(mapping)

event
0      10.000000
0       3.141593
0      -1.000000
1    1000.000000
1    1000.000000
1       3.141593
4     123.000000
4            NaN
4     123.000000
4       3.141593
Name: n, dtype: float64

In [193]:
min_z = xyz_df_1.z.min()
xyz_df_1.z.map(lambda zz: zz - min_z)

event
0    0.000000
0    3.687145
0    0.298249
1    0.917979
1    1.992441
1    1.315528
4    1.532706
4    0.616110
4    3.334865
4    0.762313
Name: z, dtype: float64

### Exercise: create a dataframe with the average position of each event in XYZ. Then compute the R and Phi positions of these average values.

### Exercise N+3: Repeat the previous exercise but adding those values to the original df

In [3]:
filename = "/media/gonzalo/Gonzalo128/data/NEXT/ECEC/bkg/kdst_7007_v0.9.9_20190111_krbg.h5"
df = load_dst(filename, "DST", "Events")
del df["index"] # ignore this
df = df.set_index("event")

In [4]:
df.head()

,time,s1_peak,s2_peak,nS1,nS2,S1w,S1h,S1e,S1t,S2w,S2h,S2e,S2q,S2t,Nsipm,DT,Z,Zrms,X,Y,R,Phi,Xrms,Yrms
event,,,,,,,,,,,,,,,,,,,,,,,,
1,1.552678e+09,0,0,1,1,125.0,1.774422,7.576289,502700.0,11.064375,2686.332764,11572.243164,566.591492,803508.1875,20,300.808197,300.808197,1.813417,-27.476126,10.951459,29.578234,2.762310,9.530958,8.647540
2,1.552678e+09,0,0,1,1,100.0,2.559768,9.263117,478700.0,8.486187,1593.130615,7850.166504,541.770203,804457.4375,19,325.757446,325.757446,1.750181,-124.831268,132.160096,181.794214,2.327684,9.003013,11.001643
3,1.552678e+09,0,0,1,1,250.0,2.215708,15.651625,269475.0,11.587750,1510.953125,9105.055664,510.414062,804482.1875,24,535.007202,535.007202,2.320408,-104.239397,98.463828,143.390994,2.384680,47.137182,10.637314
4,1.552678e+09,0,0,1,1,175.0,2.297016,11.651054,651150.0,8.495313,3248.440918,11202.635742,441.862854,802498.1875,17,151.348190,151.348190,1.298515,20.492885,76.523417,79.219895,1.309137,14.150762,9.548707
5,1.552678e+09,0,0,1,1,100.0,2.306077,7.938650,228675.0,11.723500,1687.497314,10303.931641,412.642578,805454.6875,20,576.779724,576.779724,2.358667,60.590331,-0.247818,60.590838,-0.004090,14.589671,20.130034

In [5]:
series = df.S2w.copy()

In [6]:
series.head()

event
1    11.064375
2     8.486187
3    11.587750
4     8.495313
5    11.723500
Name: S2w, dtype: float64